<?php

class m140104_173923_insert_data_in_corpuses extends CDbMigration
{

    public function up()
    {
        $this->execute("
            INSERT INTO `Corpuses` (`title`, `shortTitle`, `description`) VALUES
                ('Главный академический корпус', 'ГАК', '', '1'),
                ('Учебный корпус 1', 'У1', NULL, '14'),
                ('Учебный корпус 2', 'У2', NULL, '1'),
                ('Главный аудиторный корпус', 'ГАК', NULL, '1'),
                ('Физический корпус', '', NULL, '1'),
                ('Библиотечный корпус', '', NULL, '1'),
                ('Химический корпус', 'ХК', NULL, '1'),
                ('Ректорский корпус', '', NULL, '1'),
                ('Инженерный корпус', '', NULL, '1'),
                ('Математический корпус', '', NULL, '1'),
                ('Электрокорпус', 'ЭК', NULL, '1'),
                ('Административный корпус', '', NULL, '1'),
                ('Вечерний корпус', 'ВК', NULL, '1'),
                ('Технический корпус', 'ТК', NULL, '1'),
                ('Радиотехнический корпус', '', NULL, '1'),
                ('Лабораторный корпус №3', ' ', NULL, '1'),
                ('Учебный корпус 5', 'У5', NULL, '1'),
                ('Учебный корпус 3', 'У3', NULL, '1'),
                ('Центр подготовки иностранных граждан', '', NULL, '1'),
                ('Харьковский гвардейский факультет военной подготовки', '', NULL, '1');
        ");
    }

    public function down()
    {
    }

}
